# Data Frame 생성 및 기초통계 등 확인

In [1]:
# !pip install pandas

In [2]:
import pandas as pd
import numpy as np

In [3]:
dataset = np.array([['kor', 70], ['math', 80]])
df = pd.DataFrame(dataset, columns = ['class', 'score'])
df

  class score
0   kor    70
1  math    80

In [4]:
df1 = pd.DataFrame(data = [['kor', 70], ['math', 80]], columns = ['class', 'score'])
df1

  class  score
0   kor     70
1  math     80

In [5]:
df2 = pd.DataFrame({'class' : ['kor', 'math'], 'score' : [70, 80]})
df2

# df, df1, df2 모두 같은 의미

  class  score
0   kor     70
1  math     80

In [6]:
# !pip install scikit-learn

In [7]:
from sklearn.datasets import load_iris

In [8]:
iris = load_iris()
iris = pd.DataFrame(iris.data, columns = iris.feature_names)
iris

     sepal length (cm)  sepal width (cm)  petal length (cm)  petal width (cm)
0                  5.1               3.5                1.4               0.2
1                  4.9               3.0                1.4               0.2
2                  4.7               3.2                1.3               0.2
3                  4.6               3.1                1.5               0.2
4                  5.0               3.6                1.4               0.2
..                 ...               ...                ...               ...
145                6.7               3.0                5.2               2.3
146                6.3               2.5                5.0               1.9
147                6.5               3.0                5.2               2.0
148                6.2               3.4                5.4               2.3
149                5.9               3.0                5.1               1.8

[150 rows x 4 columns]

In [9]:
iris.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 150 entries, 0 to 149
Data columns (total 4 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   sepal length (cm)  150 non-null    float64
 1   sepal width (cm)   150 non-null    float64
 2   petal length (cm)  150 non-null    float64
 3   petal width (cm)   150 non-null    float64
dtypes: float64(4)
memory usage: 4.8 KB

In [10]:
iris.describe()

,sepal length (cm),sepal width (cm),petal length (cm),petal width (cm)
count,150.000000,150.000000,150.000000,150.000000
mean,5.843333,3.057333,3.758000,1.199333
std,0.828066,0.435866,1.765298,0.762238
min,4.300000,2.000000,1.000000,0.100000
25%,5.100000,2.800000,1.600000,0.300000
50%,5.800000,3.000000,4.350000,1.300000
75%,6.400000,3.300000,5.100000,1.800000
max,7.900000,4.400000,6.900000,2.500000

In [11]:
df.head()

  class score
0   kor    70
1  math    80

# 컬럼 및 인덱스, 데이터 타입 등 데이터 변경

In [12]:
# RangeIndex(start=0, stop=2, step=1) index의 범위를 의미
df.index

RangeIndex(start=0, stop=2, step=1)

In [13]:
list(df.index)

[0, 1]

In [14]:
df.index = ['A','B']

In [15]:
df.index

Index(['A', 'B'], dtype='object')

In [16]:
df

  class score
A   kor    70
B  math    80

In [17]:
# 컬럼을 인덱스로 변경, inplace는 원본 데이터의 변경 여부를 묻는 것이므로 다음과 같이 코드를 짜야 df가 변경되지 않음
df1 = df.set_index('class', drop = True, append = False, inplace = False) # class가 index column의 name이 되는 것이네
df1

      score
class
kor      70
math     80

In [18]:
# 인덱스를 컬럼으로 변경
df1.reset_index(drop = False, inplace = True)
df1

  class score
0   kor    70
1  math    80

In [19]:
iris.columns

Index(['sepal length (cm)', 'sepal width (cm)', 'petal length (cm)',
       'petal width (cm)'],
      dtype='object')

In [20]:
# 컬럼명 변경
iris.columns = ['sepal length', 'sepal width', 'petal length', 'petal width']
iris

     sepal length  sepal width  petal length  petal width
0             5.1          3.5           1.4          0.2
1             4.9          3.0           1.4          0.2
2             4.7          3.2           1.3          0.2
3             4.6          3.1           1.5          0.2
4             5.0          3.6           1.4          0.2
..            ...          ...           ...          ...
145           6.7          3.0           5.2          2.3
146           6.3          2.5           5.0          1.9
147           6.5          3.0           5.2          2.0
148           6.2          3.4           5.4          2.3
149           5.9          3.0           5.1          1.8

[150 rows x 4 columns]

In [21]:
# 컬럼명 문자 교체
iris.columns = iris.columns.str.replace(' ', '_')
iris.head()

   sepal_length  sepal_width  petal_length  petal_width
0           5.1          3.5           1.4          0.2
1           4.9          3.0           1.4          0.2
2           4.7          3.2           1.3          0.2
3           4.6          3.1           1.5          0.2
4           5.0          3.6           1.4          0.2

In [22]:
iris.dtypes

sepal_length    float64
sepal_width     float64
petal_length    float64
petal_width     float64
dtype: object

In [23]:
# 데이터 타입 변경
iris['sepal_length'] = iris['sepal_width'].astype('int')
iris[['sepal_width', 'petal_length']] = \ 
#파이썬에서는 줄이 바뀌면 작성 코드가 종료됨을 의미하는데 \를 통해 다음 줄의 코드도 함께 읽음
iris[['sepal_width', 'petal_length']].astype('int')
iris.head()

   sepal_length  sepal_width  petal_length  petal_width
0             3            3             1          0.2
1             3            3             1          0.2
2             3            3             1          0.2
3             3            3             1          0.2
4             3            3             1          0.2

In [24]:
iris.dtypes

sepal_length      int32
sepal_width       int32
petal_length      int32
petal_width     float64
dtype: object

# 데이터 선택
# integer location : 정수로 된 위치 기반 인덱스
# location : 레이블(인덱스의 이름 혹은 컬럼명)로 행과 열 선택

In [25]:
from sklearn.datasets import load_iris
iris = load_iris()
iris = pd.DataFrame(iris.data, columns=iris.feature_names)
iris

     sepal length (cm)  sepal width (cm)  petal length (cm)  petal width (cm)
0                  5.1               3.5                1.4               0.2
1                  4.9               3.0                1.4               0.2
2                  4.7               3.2                1.3               0.2
3                  4.6               3.1                1.5               0.2
4                  5.0               3.6                1.4               0.2
..                 ...               ...                ...               ...
145                6.7               3.0                5.2               2.3
146                6.3               2.5                5.0               1.9
147                6.5               3.0                5.2               2.0
148                6.2               3.4                5.4               2.3
149                5.9               3.0                5.1               1.8

[150 rows x 4 columns]

In [28]:
# row 선택하기 - 2행부터 4행까지 선택
iris[1:4]

   sepal length (cm)  sepal width (cm)  petal length (cm)  petal width (cm)
1                4.9               3.0                1.4               0.2
2                4.7               3.2                1.3               0.2
3                4.6               3.1                1.5               0.2

In [29]:
# column 선택하기
iris['sepal length (cm)'].head(4)

0    5.1
1    4.9
2    4.7
3    4.6
Name: sepal length (cm), dtype: float64

In [30]:
iris[['sepal length (cm)', 'sepal width (cm)']].head(4)

   sepal length (cm)  sepal width (cm)
0                5.1               3.5
1                4.9               3.0
2                4.7               3.2
3                4.6               3.1

In [31]:
# 인수를 하나만 설정하는 경우 행 출력
iris.iloc[1:4]

   sepal length (cm)  sepal width (cm)  petal length (cm)  petal width (cm)
1                4.9               3.0                1.4               0.2
2                4.7               3.2                1.3               0.2
3                4.6               3.1                1.5               0.2

In [32]:
# 인수를 두 개 설정할 경우 순서대로 행과 열을 지정
iris.iloc[[1,3,5], 2:4]

   petal length (cm)  petal width (cm)
1                1.4               0.2
3                1.5               0.2
5                1.7               0.4

In [36]:
iris.iloc[:, [True,True,False,True]]

     sepal length (cm)  sepal width (cm)  petal width (cm)
0                  5.1               3.5               0.2
1                  4.9               3.0               0.2
2                  4.7               3.2               0.2
3                  4.6               3.1               0.2
4                  5.0               3.6               0.2
..                 ...               ...               ...
145                6.7               3.0               2.3
146                6.3               2.5               1.9
147                6.5               3.0               2.0
148                6.2               3.4               2.3
149                5.9               3.0               1.8

[150 rows x 3 columns]

In [37]:
iris.loc[1:3]

   sepal length (cm)  sepal width (cm)  petal length (cm)  petal width (cm)
1                4.9               3.0                1.4               0.2
2                4.7               3.2                1.3               0.2
3                4.6               3.1                1.5               0.2

In [38]:
iris.loc[[1,2], 'sepal length (cm)' : 'petal length (cm)']

   sepal length (cm)  sepal width (cm)  petal length (cm)
1                4.9               3.0                1.4
2                4.7               3.2                1.3

# DataFrame row, column index 실습

In [125]:
import pandas as pd
score = pd.DataFrame({'국어' : [100, 80], '수학' : [75, 90], '영어' : [90,95]}, index=['장화','홍련'])
score

     국어  수학  영어
장화  100  75  90
홍련   80  90  95

In [126]:
score.loc['홍련','영어'] = 100
score['국어'] = score['국어'] -5
score

    국어  수학   영어
장화  95  75   90
홍련  75  90  100

In [127]:
import pandas as pd
new_student = pd.DataFrame({'국어' : [70, 85], '수학' : [65, 100], '영어' : [95,65]}, index=['콩쥐','팥쥐'])
new_student

    국어   수학  영어
콩쥐  70   65  95
팥쥐  85  100  65

In [128]:
score = score.append(new_student)
# 1개의 행을 추가할때는 index가 아닌 name을 추가해야 가능함
new_student1 = pd.Series({'국어':85,'수학':55,'영어':95},name = '해님')
score = score.append(new_student1)
score

    국어   수학   영어
장화  95   75   90
홍련  75   90  100
콩쥐  70   65   95
팥쥐  85  100   65
해님  85   55   95

In [129]:
score

    국어   수학   영어
장화  95   75   90
홍련  75   90  100
콩쥐  70   65   95
팥쥐  85  100   65
해님  85   55   95

In [130]:
# 열을 추가할 때는 행의 개수를 맡춰야 추가가 가능하다.
science = [80, 85, 55, 70, 80]
score['과학'] = science
score['학년'] = 1

In [131]:
score

    국어   수학   영어  과학  학년
장화  95   75   90  80   1
홍련  75   90  100  85   1
콩쥐  70   65   95  55   1
팥쥐  85  100   65  70   1
해님  85   55   95  80   1

In [132]:
score['과학'] = score['과학'] +5
score['총점'] = score['국어'] + score['수학'] + score['영어'] + score['과학']
score

    국어   수학   영어  과학  학년   총점
장화  95   75   90  85   1  345
홍련  75   90  100  90   1  355
콩쥐  70   65   95  60   1  290
팥쥐  85  100   65  75   1  325
해님  85   55   95  85   1  320

In [133]:
score.drop('장화', inplace = True)

In [134]:
score

    국어   수학   영어  과학  학년   총점
홍련  75   90  100  90   1  355
콩쥐  70   65   95  60   1  290
팥쥐  85  100   65  75   1  325
해님  85   55   95  85   1  320

In [135]:
score.drop(columns = ['과학', '학년', '총점'], inplace = True)
score

    국어   수학   영어
홍련  75   90  100
콩쥐  70   65   95
팥쥐  85  100   65
해님  85   55   95

In [136]:
student = score.reset_index(drop = False) # drop = True 하면 컬럼으로 쓰지 않고 삭제됨
student

  index  국어   수학   영어
0    홍련  75   90  100
1    콩쥐  70   65   95
2    팥쥐  85  100   65
3    해님  85   55   95

In [137]:
student.rename(columns = {'index' : '이름'}, inplace = True) # 컬럼명 변경
student

   이름  국어   수학   영어
0  홍련  75   90  100
1  콩쥐  70   65   95
2  팥쥐  85  100   65
3  해님  85   55   95

In [138]:
student[student['이름']== '홍련']

   이름  국어  수학   영어
0  홍련  75  90  100

In [139]:
student[(student['국어'] >= 75)& (student['수학'] >= 80)]

   이름  국어   수학   영어
0  홍련  75   90  100
2  팥쥐  85  100   65

In [140]:
new_1 = pd.Series({'국어':85,'수학':55,'영어':95},name = '해님')
score = score.append(new_1)
student

   이름  국어   수학   영어
0  홍련  75   90  100
1  콩쥐  70   65   95
2  팥쥐  85  100   65
3  해님  85   55   95

In [141]:
student

   이름  국어   수학   영어
0  홍련  75   90  100
1  콩쥐  70   65   95
2  팥쥐  85  100   65
3  해님  85   55   95

In [142]:
student.loc[(student['국어'] >= 75)& (student['수학'] >= 80)]

   이름  국어   수학   영어
0  홍련  75   90  100
2  팥쥐  85  100   65

In [145]:
#다른 행 추가방법
student.loc[4,'이름':'영어'] = ['수영',70,80,None]
student

   이름    국어     수학     영어
0  홍련  75.0   90.0  100.0
1  콩쥐  70.0   65.0   95.0
2  팥쥐  85.0  100.0   65.0
3  해님  85.0   55.0   95.0
4  수영  70.0   80.0    NaN

In [146]:
student

   이름    국어     수학     영어
0  홍련  75.0   90.0  100.0
1  콩쥐  70.0   65.0   95.0
2  팥쥐  85.0  100.0   65.0
3  해님  85.0   55.0   95.0
4  수영  70.0   80.0    NaN

In [147]:
#합격 컬럼 추가 및 Pass, Fail 입력
student.loc[(student['국어'] >= 75)& (student['수학'] >= 70),'합격'] = 'Pass'
student.loc[student['합격'] != 'Pass', '합격'] = 'Fail'
student

   이름    국어     수학     영어    합격
0  홍련  75.0   90.0  100.0  Pass
1  콩쥐  70.0   65.0   95.0  Fail
2  팥쥐  85.0  100.0   65.0  Pass
3  해님  85.0   55.0   95.0  Fail
4  수영  70.0   80.0    NaN  Fail

In [148]:
import numpy as np
cond_list = [(student['수학']>=90),
             (student['수학']>=80) & (student['수학']<90),
             (student['수학']>=70) & (student['수학']<80)]
credit_list = ['A', 'B', 'C']
student['학점'] = np.select(cond_list, credit_list, default='F')
student

   이름    국어     수학     영어    합격 학점
0  홍련  75.0   90.0  100.0  Pass  A
1  콩쥐  70.0   65.0   95.0  Fail  F
2  팥쥐  85.0  100.0   65.0  Pass  A
3  해님  85.0   55.0   95.0  Fail  F
4  수영  70.0   80.0    NaN  Fail  B

# 결측값 대체

In [149]:
#결측값
student.isna()

      이름     국어     수학     영어     합격     학점
0  False  False  False  False  False  False
1  False  False  False  False  False  False
2  False  False  False  False  False  False
3  False  False  False  False  False  False
4  False  False  False   True  False  False

In [150]:
#결측이 아닌 값
student.notna()

     이름    국어    수학     영어    합격    학점
0  True  True  True   True  True  True
1  True  True  True   True  True  True
2  True  True  True   True  True  True
3  True  True  True   True  True  True
4  True  True  True  False  True  True

In [151]:
# 컬럼의 Nan 합계
student.isna().sum()

이름    0
국어    0
수학    0
영어    1
합격    0
학점    0
dtype: int64

In [152]:
# 행의 Nan 합계
student.isna().sum(1)

0    0
1    0
2    0
3    0
4    1
dtype: int64

In [156]:
student

   이름    국어     수학     영어    합격 학점
0  홍련  75.0   90.0  100.0  Pass  A
1  콩쥐  70.0   65.0   95.0  Fail  F
2  팥쥐  85.0  100.0   65.0  Pass  A
3  해님  85.0   55.0   95.0  Fail  F
4  수영  70.0   80.0    NaN  Fail  B

In [155]:
Expdropna = student
Expdropna.dropna() # 결측값이 포함된 모든 행을 삭제

   이름    국어     수학     영어    합격 학점
0  홍련  75.0   90.0  100.0  Pass  A
1  콩쥐  70.0   65.0   95.0  Fail  F
2  팥쥐  85.0  100.0   65.0  Pass  A
3  해님  85.0   55.0   95.0  Fail  F

In [164]:
Expthresh = student
Expthresh.dropna(thresh=6) # 결측값이 아닌 값이 6개보다 많은 행만 남기기

   이름    국어     수학     영어    합격 학점
0  홍련  75.0   90.0  100.0  Pass  A
1  콩쥐  70.0   65.0   95.0  Fail  F
2  팥쥐  85.0  100.0   65.0  Pass  A
3  해님  85.0   55.0   95.0  Fail  F

In [169]:
health = pd.DataFrame({'연도':[2017, 2018, 2019, 2020, 2021, 2022]
                      ,'키':[160,162,165,None, None, 166]
                      ,'몸무게':[53,52,None, 50,51,54]
                      ,'시력':[1.2,None, 1.2,1.2,1.1,0.8]
                      ,'병결':[None, None, None, 2,None, 1]})
health.fillna(0) # NaN값을 0으로 대체

     연도      키   몸무게   시력   병결
0  2017  160.0  53.0  1.2  0.0
1  2018  162.0  52.0  0.0  0.0
2  2019  165.0   0.0  1.2  0.0
3  2020    0.0  50.0  1.2  2.0
4  2021    0.0  51.0  1.1  0.0
5  2022  166.0  54.0  0.8  1.0

In [170]:
health.fillna(health.mean()) # NaN값을 평균으로 대체

     연도       키   몸무게   시력   병결
0  2017  160.00  53.0  1.2  1.5
1  2018  162.00  52.0  1.1  1.5
2  2019  165.00  52.0  1.2  1.5
3  2020  163.25  50.0  1.2  2.0
4  2021  163.25  51.0  1.1  1.5
5  2022  166.00  54.0  0.8  1.0

In [173]:
health['병결'] = health['병결'].fillna(0)
health['몸무게'] = health['몸무게'].fillna(health['몸무게'].mean())
health

     연도      키   몸무게   시력   병결
0  2017  160.0  53.0  1.2  0.0
1  2018  162.0  52.0  NaN  0.0
2  2019  165.0  52.0  1.2  0.0
3  2020    NaN  50.0  1.2  2.0
4  2021    NaN  51.0  1.1  0.0
5  2022  166.0  54.0  0.8  1.0

In [174]:
health.fillna(method = 'pad', inplace = True) # NaN값을 결측값이 등장하기 바로 직전 값으로 대체
health

     연도      키   몸무게   시력   병결
0  2017  160.0  53.0  1.2  0.0
1  2018  162.0  52.0  1.2  0.0
2  2019  165.0  52.0  1.2  0.0
3  2020  165.0  50.0  1.2  2.0
4  2021  165.0  51.0  1.1  0.0
5  2022  166.0  54.0  0.8  1.0

In [175]:
# 중복행 삭제
health['키'].drop_duplicates()

0    160.0
1    162.0
2    165.0
5    166.0
Name: 키, dtype: float64

In [177]:
set(health['키'])

{160.0, 162.0, 165.0, 166.0}

In [179]:
health[['시력','병결']].drop_duplicates()

    시력   병결
0  1.2  0.0
3  1.2  2.0
4  1.1  0.0
5  0.8  1.0

# 데이터 정렬
axis : 0이면 행 기준, 1이면 컬럼명 기준으로 정렬

In [180]:
import pandas as pd
from sklearn.datasets import load_iris
iris = load_iris()
iris = pd.DataFrame(iris.data, columns = iris.feature_names)

In [181]:
iris.sort_index(ascending = False, inplace = True) # index 내림차순
iris.head()

     sepal length (cm)  sepal width (cm)  petal length (cm)  petal width (cm)
149                5.9               3.0                5.1               1.8
148                6.2               3.4                5.4               2.3
147                6.5               3.0                5.2               2.0
146                6.3               2.5                5.0               1.9
145                6.7               3.0                5.2               2.3

In [183]:
iris.sort_index(axis=1, ascending=True, inplace=True) #column 오름차순
iris.head()

     petal length (cm)  petal width (cm)  sepal length (cm)  sepal width (cm)
149                5.1               1.8                5.9               3.0
148                5.4               2.3                6.2               3.4
147                5.2               2.0                6.5               3.0
146                5.0               1.9                6.3               2.5
145                5.2               2.3                6.7               3.0

In [185]:
iris.sort_values('petal length (cm)', ascending = False) # 필드값 기준 내림차순

     petal length (cm)  petal width (cm)  sepal length (cm)  sepal width (cm)
118                6.9               2.3                7.7               2.6
122                6.7               2.0                7.7               2.8
117                6.7               2.2                7.7               3.8
105                6.6               2.1                7.6               3.0
131                6.4               2.0                7.9               3.8
..                 ...               ...                ...               ...
36                 1.3               0.2                5.5               3.5
35                 1.2               0.2                5.0               3.2
14                 1.2               0.2                5.8               4.0
13                 1.1               0.1                4.3               3.0
22                 1.0               0.2                4.6               3.6

[150 rows x 4 columns]

In [190]:
iris.sort_values(['petal length (cm)', 'petal width (cm)'],ascending = False) # 필드값 기준 내림차순(첫 컬럼 우선)

     petal length (cm)  petal width (cm)  sepal length (cm)  sepal width (cm)
118                6.9               2.3                7.7               2.6
117                6.7               2.2                7.7               3.8
122                6.7               2.0                7.7               2.8
105                6.6               2.1                7.6               3.0
131                6.4               2.0                7.9               3.8
..                 ...               ...                ...               ...
2                  1.3               0.2                4.7               3.2
35                 1.2               0.2                5.0               3.2
14                 1.2               0.2                5.8               4.0
13                 1.1               0.1                4.3               3.0
22                 1.0               0.2                4.6               3.6

[150 rows x 4 columns]

# 데이터 결합
axis = 0 이면 열 방향으로 합치고 1이면 행 방향으로 합침

In [192]:
import pandas as pd
HR1 = pd.DataFrame({'이름':['장화','홍련']
                   ,'부서':['영업','회계']
                   ,'직급':['팀장','사원']})
HR2 = pd.DataFrame({'이름':['콩쥐','팥쥐']
                   ,'직급':['사원','팀장']
                   ,'부서':['영업','인사']})
pd.concat([HR1, HR2], axis=0)

   이름  부서  직급
0  장화  영업  팀장
1  홍련  회계  사원
0  콩쥐  영업  사원
1  팥쥐  인사  팀장

In [193]:
pd.concat([HR1, HR2], axis=1)

   이름  부서  직급  이름  직급  부서
0  장화  영업  팀장  콩쥐  사원  영업
1  홍련  회계  사원  팥쥐  팀장  인사

In [194]:
HR3 = pd.DataFrame({'이름':['콩쥐','팥쥐']
                   ,'부서':['영업','인사']
                   ,'급여':[3500,2800]})
pd.concat([HR1,HR3],axis =0)

   이름  부서   직급      급여
0  장화  영업   팀장     NaN
1  홍련  회계   사원     NaN
0  콩쥐  영업  NaN  3500.0
1  팥쥐  인사  NaN  2800.0

In [199]:
HR4 = pd.Series({1:2500},name='급여')
pd.concat([HR1,HR4],axis=1)

   이름  부서  직급      급여
0  장화  영업  팀장     NaN
1  홍련  회계  사원  2500.0

In [200]:
HR5 = pd.DataFrame({'급여':[4500,3000,3500]})
pd.concat([HR1,HR5],axis=1)

    이름   부서   직급    급여
0   장화   영업   팀장  4500
1   홍련   회계   사원  3000
2  NaN  NaN  NaN  3500

In [201]:
# Inner Join
product = pd.DataFrame({'상품코드':['G1','G2','G3','G4']
                       ,'상품명':['우유','감자','빵','치킨']})
sale = pd.DataFrame({'주문번호':[1001,1002,1002,1003,1004]
                    ,'상품코드':['G4','G3','G1','G3','G5']
                    ,'주문수량':[1,4,2,2,3]})
sale.merge(product, on='상품코드',how='inner')

   주문번호 상품코드  주문수량 상품명
0  1001   G4     1  치킨
1  1002   G3     4   빵
2  1003   G3     2   빵
3  1002   G1     2  우유

In [205]:
sale.merge(product, on='상품코드',how='outer',sort=True) # 상품코드를 기준으로 sort함

     주문번호 상품코드  주문수량  상품명
0  1002.0   G1   2.0   우유
1     NaN   G2   NaN   감자
2  1002.0   G3   4.0    빵
3  1003.0   G3   2.0    빵
4  1001.0   G4   1.0   치킨
5  1004.0   G5   3.0  NaN

In [207]:
sale.merge(product,left_on = '상품코드',right_on='상품코드',how='left')

   주문번호 상품코드  주문수량  상품명
0  1001   G4     1   치킨
1  1002   G3     4    빵
2  1002   G1     2   우유
3  1003   G3     2    빵
4  1004   G5     3  NaN

# 데이터 요약
Group by : 집계함수(count,sum,nub 등과 함께 쓰인다)

In [210]:
import pandas as pd
from sklearn.datasets import load_iris
IRIS = load_iris()
iris = pd.DataFrame(data=IRIS.data, columns = IRIS.feature_names)
iris['class'] = IRIS.target
iris['class'] = iris['class'].map({0:'setosa',1:'versicolor',2:'virginica'})

,sepal length (cm),sepal width (cm),petal length (cm),petal width (cm)
class,,,,
setosa,5.006,3.428,1.462,0.246
versicolor,5.936,2.770,4.260,1.326
virginica,6.588,2.974,5.552,2.026

In [211]:
iris.groupby(by='class').mean()

,sepal length (cm),sepal width (cm),petal length (cm),petal width (cm)
class,,,,
setosa,5.006,3.428,1.462,0.246
versicolor,5.936,2.770,4.260,1.326
virginica,6.588,2.974,5.552,2.026

In [212]:
iris.groupby(by='class').median()

,sepal length (cm),sepal width (cm),petal length (cm),petal width (cm)
class,,,,
setosa,5.0,3.4,1.50,0.2
versicolor,5.9,2.8,4.35,1.3
virginica,6.5,3.0,5.55,2.0

# 도수분포표
자료를 몇 개의 구간으로 나누고, 나누어진 각 구간에 속한 자료의 개수를 정리한 표

In [213]:
pd.Series(iris['class']).value_counts()

versicolor    50
setosa        50
virginica     50
Name: class, dtype: int64

In [216]:
iris['petal width level'] = pd.qcut(iris['petal width (cm)'], q=3, labels=['short','middle','long'])
pd.Series(iris['petal width level']).value_counts().to_frame()

        petal width level
middle                 52
short                  50
long                   48

In [217]:
pd.crosstab(iris['petal width level'], iris['class'])

class              setosa  versicolor  virginica
petal width level
short                  50           0          0
middle                  0          48          4
long                    0           2         46